Revit 2027 API
BuiltInFailures.OpeningFailures.ModelAlreadyCheckedOutByUser Property
 The Cloud WorkSharing Model is already checked out by the current user.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ModelAlreadyCheckedOutByUser { get; }
Public Shared ReadOnly Property ModelAlreadyCheckedOutByUser As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ModelAlreadyCheckedOutByUser {
	FailureDefinitionId^ get ();
}
static member ModelAlreadyCheckedOutByUser : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace